app/views/admin_user_expenses/index.html.erb

    <p>Admin User: <%= current_admin_user.email %></p>
    <p>Number of Records: <%= current_admin_user.admin_user_expenses.count %></p>
---
SELECT "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."admin_user_id" = $1  [["admin_user_id", 1]]
SELECT COUNT(*) FROM "admin_user_expenses" WHERE "admin_user_expenses"."admin_user_id" = $1  [["admin_user_id", 1]]