app/views/admin_user_expenses/other_expenses.html.erb

SELECT "users".* FROM "users"
---
<% User.all.each do |user| %>

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
---
  <table>
    <% user.expenses.each do |expense| %>