app/controllers/admin_user_reports_controller.rb

SELECT "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."admin_user_id" = $1 AND (created_at between ('2017-01-25 08:00:00') and ('2017-01-27 08:00:00'))  [["admin_user_id", 1]]
SELECT "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."admin_user_id" = $1  [["admin_user_id", 1]]
SELECT SUM("admin_user_expenses"."amount") AS sum_amount, DATE_TRUNC('week', created_at) AS date_trunc_week_created_at FROM "admin_user_expenses" WHERE "admin_user_expenses"."admin_user_id" = $1 GROUP BY DATE_TRUNC('week', created_at)  [["admin_user_id", 1]]
---
  def index
  	@admin_user_expenses = current_admin_user.admin_user_expenses.where(nil).order('created_at asc')
  	@admin_user_day_report = current_admin_user.admin_user_expenses.group("DATE_TRUNC('week', created_at)").sum(:amount)