app/controllers/admin_user_expenses_controller.rb

SELECT  "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@admin_user_expense = AdminUserExpense.find(params[:id])

SELECT  "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
	def edit
		@admin_user_expense = AdminUserExpense.find(params[:id])

INSERT INTO "admin_user_expenses" ("description", "amount", "created_at", "updated_at", "admin_user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "admin"], ["amount", 10.5], ["created_at", 2017-01-27 01:12:03 UTC], ["updated_at", 2017-01-27 01:12:03 UTC], ["admin_user_id", 1]]
---
	def create
		@admin_user_expense = AdminUserExpense.new(admin_user_expense_params)
		@admin_user_expense.admin_user_id = current_admin_user.id

		if @admin_user_expense.save

SELECT  "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "admin_user_expenses" SET "description" = $1, "updated_at" = $2 WHERE "admin_user_expenses"."id" = $3  [["description", "groceries"], ["updated_at", 2017-01-28 00:16:44 UTC], ["id", 8]]
---
	def update
		@admin_user_expense = AdminUserExpense.find(params[:id])

		if @admin_user_expense.update(admin_user_expense_params)

SELECT  "admin_user_expenses".* FROM "admin_user_expenses" WHERE "admin_user_expenses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "admin_user_expenses" WHERE "admin_user_expenses"."id" = $1  [["id", 3]]
---
	def destroy
		@admin_user_expense = AdminUserExpense.find(params[:id])
		@admin_user_expense.destroy