app/controllers/admin_user_reports_controller.rb

  def index
  	@admin_user_expenses = current_admin_user.admin_user_expenses.where(nil)
  	Rails.logger.debug @admin_user_expenses.count
---
SELECT COUNT(*) FROM "admin_user_expenses" WHERE "admin_user_expenses"."admin_user_id" = $1  [["admin_user_id", 1]]