app/controllers/expenses_controller.rb

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@expense = Expense.find(params[:id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@expense = Expense.find(params[:id])

INSERT INTO "expenses" ("description", "amount", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "aa"], ["amount", 13.2], ["created_at", 2017-01-27 00:15:12 UTC], ["updated_at", 2017-01-27 00:15:12 UTC], ["user_id", 1]]
---
	def create
		@expense = Expense.new(expense_params)
		@expense.user_id = current_user.id

		if @expense.save

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "expenses" SET "description" = $1, "updated_at" = $2 WHERE "expenses"."id" = $3  [["description", "bb"], ["updated_at", 2017-01-27 00:12:37 UTC], ["id", 1]]
---
	def update
		@expense = Expense.find(params[:id])

		if @expense.update(expense_params)

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 3]]
---
	def destroy
		@expense = Expense.find(params[:id])
		@expense.destroy