app/controllers/reports_controller.rb

  def index
  	@expenses = current_user.expenses.where(nil).order('created_at asc')
  	@day_report = current_user.expenses.group("DATE_TRUNC('week', created_at)").sum(:amount)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1 AND (created_at between ('2017-01-26') and ('2017-01-27'))  [["user_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
SELECT SUM("expenses"."amount") AS sum_amount, DATE_TRUNC('week', created_at) AS date_trunc_week_created_at FROM "expenses" WHERE "expenses"."user_id" = $1 GROUP BY DATE_TRUNC('week', created_at)  [["user_id", 1]]