app/controllers/reports_controller.rb

SELECT COUNT(*) FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
---
  def index
  	@expenses = current_user.expenses.where(nil)
  	Rails.logger.debug @expenses.count