app/views/expenses/index.html.erb

    <p>User: <%= current_user.email %></p>
    <p>Number of Records: <%= current_user.expenses.count %></p>
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]