app/views/reports/index.html.erb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."user_id" = $1  [["user_id", 1]]
---
    <p>User: <%= current_user.email %></p>
    <p>Number of Total Records: <%= current_user.expenses.count %></p>